ElektronikaSales/PIC18F47K42_GPIO_LED/PIC18F47K42_GPIO_LED.X/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.8
        Device            :  PIC18F47K42
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.36 and above
        MPLAB 	          :  MPLAB X 6.00	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set RED_LED_RD2 aliases
#define RED_LED_RD2_TRIS                 TRISDbits.TRISD2
#define RED_LED_RD2_LAT                  LATDbits.LATD2
#define RED_LED_RD2_PORT                 PORTDbits.RD2
#define RED_LED_RD2_WPU                  WPUDbits.WPUD2
#define RED_LED_RD2_OD                   ODCONDbits.ODCD2
#define RED_LED_RD2_ANS                  ANSELDbits.ANSELD2
#define RED_LED_RD2_SetHigh()            do { LATDbits.LATD2 = 1; } while(0)
#define RED_LED_RD2_SetLow()             do { LATDbits.LATD2 = 0; } while(0)
#define RED_LED_RD2_Toggle()             do { LATDbits.LATD2 = ~LATDbits.LATD2; } while(0)
#define RED_LED_RD2_GetValue()           PORTDbits.RD2
#define RED_LED_RD2_SetDigitalInput()    do { TRISDbits.TRISD2 = 1; } while(0)
#define RED_LED_RD2_SetDigitalOutput()   do { TRISDbits.TRISD2 = 0; } while(0)
#define RED_LED_RD2_SetPullup()          do { WPUDbits.WPUD2 = 1; } while(0)
#define RED_LED_RD2_ResetPullup()        do { WPUDbits.WPUD2 = 0; } while(0)
#define RED_LED_RD2_SetPushPull()        do { ODCONDbits.ODCD2 = 0; } while(0)
#define RED_LED_RD2_SetOpenDrain()       do { ODCONDbits.ODCD2 = 1; } while(0)
#define RED_LED_RD2_SetAnalogMode()      do { ANSELDbits.ANSELD2 = 1; } while(0)
#define RED_LED_RD2_SetDigitalMode()     do { ANSELDbits.ANSELD2 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/